Repository: CSchlipp/nextcloud-cookbook
Catalog: translationfiles/*/cookbook.po
Languages: es, fr, pl, ru, sv

source: Path to your recipe collection
es: Ruta a tu colección de recetas
fr: Répertoire de votre collection de recettes
pl: Ścieżka do Twojej kolekcji przepisów
ru: Путь к вашей коллекции рецептов
sv: Sökväg till din receptsamling

source: Could not set recipe folder to {path}
es: No fue posible establecer {path} como ruta para la carpeta de recetas
fr: Impossible de définir le répertoire de recette sur {path}
pl: Nie można ustawić folderu przepisów na {path}
ru: Не удалось заменить папку с рецептами на {path}
sv: Kunde inte välja receptkatalog eller sökväg

source: Please pick a recipe
es: Selecciona una receta
fr: Veuillez choisir une recette
pl: Proszę wybrać przepis
ru: Пожалуйста, выберите рецепт
sv: Välj ett recpt

source: Could not load recipe
es: No fue posible cargar la receta
fr: Impossible de charger la recette
pl: Nie można załadować przepisu
ru: Не удалось загрузить рецепт
sv: Kan inte hämta recept

source: Could not update recipe
es: No fue posible actualizar la receta
fr: Impossible de mettre à jour la recette
pl: Nie można zaktualizować przepisu
ru: Не удалось обновить рецепт
sv: Kunde inte uppdatera recept

source: Could not add recipe
es: No fue posible añadir la receta
fr: Impossible d'ajouter la recette
pl: Nie można dodać przepisu
ru: Не удалось добавить рецепт
sv: Kunde inte lägga till recept

source: Could not rebuild recipe index.
es: No fue posible recrear el índice de recetas.
fr: Impossible de reconstruire l'index des recettes.
pl: Nie można odbudować indeksu przepisów.
ru: Не удалось перестроить каталог рецептов
sv: Kunde inte bygga om receptindex

source: Are you sure you want to delete this recipe?
es: ¿Realmente quieres borrar la receta?
fr: Êtes-vous sur de vouloir effacer cette recette ?
pl: Czy na pewno chcesz usunąć ten przepis?
ru: Вы уверены, что хотите удалить рецепт?
sv: Är du säker på att du vill ta bort detta recept?

source: Failed to delete recipe
es: No se ha podido borrar la receta
fr: Impossible de supprimer la recette
pl: Nie udało się usunąć przepisu
ru: Не удалось удалить рецепт
sv: Misslyckades med att ta bort recept

source: Failed to fetch recipes
es: No se ha podido obtener la receta
fr: Impossible de récupérer les recettes
pl: Nie udało się pobrać przepisów
ru: Ошибка при получении рецептов
sv: Hämtning av recept misslyckades

source: Cookbook
es: Recetario
fr: Livre de recettes
pl: Książka kucharska
ru: Кулинарная книга
sv: Kokbok

source: An integrated cookbook using schema.org JSON files as recipes
es: Recetario que utiliza archivos JSON para recetas según el estándar schema.org
fr: Un livre de recettes intégré utilisant les fichiers JSON de schema.org comme recettes
pl: Zintegrowana książka kucharska wykorzystująca pliki JSON schema.org jako przepisy kulinarne
ru: Интегрированная кулинарная книга, использующая JSON-файлы schema.org для рецептов
sv: En integrerad kokbok som använder schema.org JSON filer som recept

source: A library for all your recipes. It uses JSON files following the schema.org recipe format. To add a recipe to the collection, you can paste in the URL of the recipe, and the provided web page will be parsed and downloaded to whichever folder you specify in the app settings.
es: Una biblioteca para todas tus recetas. Utiliza archivos en formato JSON, según el estándar schema.org. Para añadir una receta a la colección puedes copiar y pegar el URL de la receta, de manera que la página web es analizada y descargada en la carpeta especificada en la configuración de la aplicación.
fr: Une bibliothèque pour toutes vos recettes. Utilise des fichiers JSON suivant les modèles de recettes de schema.org. Pour ajouter une recette à la collection, vous pouvez coller l'URL de la recette, et la page Web fournie sera analysée et téléchargée dans n'importe quel dossier que vous spécifiez dans les paramètres de l'application.
pl: Biblioteka dla wszystkich twoich przepisów. Wykorzystuje pliki JSON zgodne z formatem schema.org. Aby dodać przepis do kolekcji, możesz wkleić adres URL przepisu, a podana strona internetowa zostanie przeanalizowana i pobrana do dowolnego folderu określonego w ustawieniach aplikacji.
ru: Библиотека для всех ваших рецептов. Использует JSON-файлы, составленные по формату рецептов schema.org. Для добавления рецептов в коллекцию можно указать URL рецепта, и указанная веб-страница будет просканирована и загружена в папку, указанную Вами в настройках приложения.
sv: Ett bibliotek för alla dina recept. Det använder JSON-filer som följerschema.org-formatet. För att lägga till ett recept i din samling, kopierain URL-länken till receptet, så kommer webbsidan med receptet att analyserasoch laddas ned till den mapp du valt i Inställningar.

source: Name
es: Nombre
fr: Nom
pl: Nazwa
ru: Название
sv: Namn

source: Image URL
es: URL de la imagen
fr: URL de l'image
pl: Adres URL obrazu

source: Keywords (comma-separated)
es: Palabras clave (separadas por comas)
fr: Mots clés (séparés par une virgule)
pl: Słowa kluczowe (oddzielone przecinkami)
ru: Ключевые слова (разделённые запятой)
sv: Nyckelord (kommaseparerad)

source: Servings
es: Porciones
fr: Portions
pl: Porcje
ru: Порции
sv: Portioner

source: Beans and legumes
es: Frijoles/judías y legumbres
fr: Haricots et Légumes
pl: Fasola i rośliny strączkowe

source: Berries
es: Moras
fr: Baies
pl: Jagody

source: Cruciferous vegetables
es: Vegetales crucíferos (col, brócoli, rábano, etc.)
fr: Légumes crucifères
pl: Warzywa kapustne

source: Flaxseeds
es: Semillas de lino
fr: Graines de lin
pl: Nasiona lnu

source: Greens
fr: Légumes verts
pl: Zielenina

source: Nuts and seeds
es: Frutos secos y semillas
fr: Noix et graines
pl: Orzechy i nasiona

source: Other fruits
es: Otras frutas
fr: Autres fruits
pl: Pozostałe owoce

source: Other vegetables
es: Otros vegetales
fr: Autres Légumes
pl: Pozostałe warzywa

source: Herbs and spices
es: Hierbas y especies
fr: Herbes et épices
pl: Zioła i przyprawy

source: Whole grains
es: Granos enteros
fr: Grains entiers
pl: Pełnoziarniste

source: Daily dozen
fr: Douzaine quotidienne
pl: Codziennie kilkanaście

source: Ingredients
es: Ingredientes
fr: Ingrédients
pl: Składniki
ru: Ингредиенты
sv: Ingredienser

source: Instructions
es: Instrucciones
pl: Instrukcje
ru: Инструкции
sv: Instruktioner

source: Save
es: Guardar
fr: Sauver
pl: Zapisz
ru: Сохранить
sv: Spara

source: One serving
es: Una porción
fr: Une portion
pl: Jedna porcja

source: Create recipe
es: Crear nueva receta
fr: Créer une recette
pl: Stwórz przepis
ru: Создать рецепт
sv: Skapa recept

source: Recipe URL
es: URL de la receta
fr: URL de la recette
pl: Adres URL przepisu
ru: URL рецепта
sv: Recept URL

source: Download recipe
es: Descargar receta
fr: Télécharger la recette
pl: Pobierz przepis
ru: Скачать рецепт
sv: Ladda ned recept

source: Search
es: Buscar
fr: Chercher
pl: Szukaj
ru: Поиск
sv: Sök

source: Edit recipe
es: Editar receta
fr: Editer la recette
pl: Edytuj przepis
ru: Изменить рецепт
sv: Redigera recept

source: Delete recipe
es: Borrar receta
fr: Effacer la recette
pl: Usuń przepis
ru: Удалить рецепт
sv: Ta bort recept

source: Settings
es: Ajustes
fr: Réglages
pl: Ustawienia
ru: Настройки
sv: Inställnigar

source: Rescan library
es: Releer biblioteca
fr: Rescanner la bibliothèque
pl: Skanowanie biblioteki
ru: Сканировать библиотеку
sv: Uppdatera bibliotek

source: Recipe folder
es: Carpeta de recetas
fr: Dossier des recettes
pl: Folder przepisu
ru: Папка с рецептами
sv: Receptkatalog

source: Please pick a folder
es: Seleccionar una carpeta
fr: Veuillez choisir un dossier
pl: Proszę wybierać folder
ru: Пожалуйста, выберите папку
sv: Välj katalog

source: Description
pl: Opis
ru: Описание
sv: Beskrivning

source: Source URL
fr: URL source
pl: Adres źródłowy URL

source: Print recipe
fr: Imprimer recette
pl: Wydrukuj przepis
ru: Напечатать рецепт
sv: Skriv ut recept

source: Source
pl: Źródło
ru: Источник
sv: Källa

source: Preparation time
fr: Temps de préparation
pl: Czas przygotowania
ru: Время приготовления
sv: Förberedningstid

source: Cooking time
fr: Temps de cuisson
pl: Czas gotowania
ru: Время готовки
sv: Tillagningstid

source: Could not set recipe update interval to {interval}
fr: Impossible de définir l'intervalle de mise à jour à {interval}
pl: Nie można ustawić interwału aktualizacji receptury na {Interval}
ru: Не удалось заменить интервал обновления рецептов на {interval}
sv: Kunde inte välja uppdateringsinterval till {interval}

source: Image
pl: Obraz
ru: Изображение
sv: Bild

source: Pick a local image
fr: Prendre une image locale
pl: Wybierz obraz lokalny
ru: Выберите изображение на компьютере
sv: Välj en bild

source: All
fr: Tous
pl: Wszystko
ru: Все
sv: Samtliga

source: Update interval in minutes
fr: Intervalle de mise à jour en minutes
pl: Interwał aktualizacji w minutach
ru: Интервал обновления в минутах
sv: Uppdateringsintervall

source: Last update
fr: Dernière mise à jour
pl: Ostatnia aktualizacja
ru: Последнее обновление
sv: Senaste uppdatering

source: Prep Time
fr: Temps prép.

source: Cook Time
fr: Temps cuisson

source: Path to your Recipe Image
ru: Путь к изображению рецепта
sv: Sökväg till din receptbild

source: Total time
ru: Общее время
sv: Total tid

source: Tools
ru: Инструменты
sv: Verktyg

source: Uncategorized
ru: Без категории
sv: Okategoriserade
